glcloud/keil_v5/ARM/PACK/.Web/Keil.EFM32Gxxx_DFP.pdsc
        <!-- *************************  Device 'EFM32G280F64'  ***************************** -->
        <device Dname="EFM32G280F64">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G280F64"/>
          <debug svd="SVD/EFM32G/EFM32G280F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G280F128'  ***************************** -->
        <device Dname="EFM32G280F128">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G280F128"/>
          <debug svd="SVD/EFM32G/EFM32G280F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G290'  **************************** -->
      <subFamily DsubFamily="EFM32G290">
        <feature type="Touch"         n="16"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtBus"        n="1"       m="16"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="90"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="BGA"           n="112"/>

        <book name="Documents/EFM32G290.pdf" title="EFM32G290 Data Sheet"/>

        <!-- *************************  Device 'EFM32G290F32'  ***************************** -->
        <device Dname="EFM32G290F32">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G290F32"/>
          <debug svd="SVD/EFM32G/EFM32G290F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G290F64'  ***************************** -->
        <device Dname="EFM32G290F64">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G290F64"/>
          <debug svd="SVD/EFM32G/EFM32G290F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G290F128'  ***************************** -->
        <device Dname="EFM32G290F128">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G290F128"/>
          <debug svd="SVD/EFM32G/EFM32G290F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G800'  **************************** -->
      <subFamily DsubFamily="EFM32G800">
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.24"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="90"/>
        <feature type="Timer"         n="3"       m="16"/>

        <book name="Documents/EFM32G800.pdf" title="EFM32G800 Data Sheet"/>

        <!-- *************************  Device 'EFM32G800F128'  ***************************** -->
        <device Dname="EFM32G800F128">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G800F128"/>
          <debug svd="SVD/EFM32G/EFM32G800F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G840'  **************************** -->
      <subFamily DsubFamily="EFM32G840">
        <feature type="Touch"         n="8"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.24"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="56"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="QFN"           n="64"/>

        <book name="Documents/EFM32G840.pdf" title="EFM32G840 Data Sheet"/>

        <!-- *************************  Device 'EFM32G840F32'  ***************************** -->
        <device Dname="EFM32G840F32">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G840F32"/>
          <debug svd="SVD/EFM32G/EFM32G840F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

